Topics:

    1. Read csv
    2. Write csv
    3. Read excel
    4. Write Excel

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"D:\Ankit\Pandas\4_read_write_to_excel\stock_data.csv")

In [3]:
df

  stocks_data     Unnamed: 1 Unnamed: 2 Unnamed: 3     Unnamed: 4
0     tickers            eps    revenue      price         people
1       GOOGL          27.82         87        845     larry page
2         WMT           4.61        484         65           n.a.
3        MSFT             -1         85         64     bill gates
4        RIL   not available         50       1023  mukesh ambani
5        TATA            5.6         -1       n.a.     ratan tata

In [9]:
#to skip first row
df = pd.read_csv(r"D:\Ankit\Pandas\4_read_write_to_excel\stock_data.csv",skiprows=1)
#df = pd.read_csv(r"D:\Ankit\Pandas\4_read_write_to_excel\stock_data.csv",header=1) (work work as same as skiprows)

In [10]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [12]:
#Suppose your dataframe doesnt have columns so you need to make it 
df = pd.read_csv(r"D:\Ankit\Pandas\4_read_write_to_excel\stock_data.csv",header=None,names=["h1","h2","h3","h4","h5"])

In [13]:
df

            h1             h2       h3     h4             h5
0  stocks_data            NaN      NaN    NaN            NaN
1      tickers            eps  revenue  price         people
2        GOOGL          27.82       87    845     larry page
3          WMT           4.61      484     65           n.a.
4         MSFT             -1       85     64     bill gates
5         RIL   not available       50   1023  mukesh ambani
6         TATA            5.6       -1   n.a.     ratan tata

In [14]:
#Suppose you just want to put first 3 rows in your dataframe
df = pd.read_csv(r"D:\Ankit\Pandas\4_read_write_to_excel\stock_data.csv",header=1,nrows=3)

In [15]:
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [16]:
df = pd.read_csv(r"D:\Ankit\Pandas\4_read_write_to_excel\stock_data.csv",header=1)

In [17]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [ ]:
#Above dataframe shows there are couple of n.a/not available values which r considered normal texts/values by pandas
#So to make sure pandas see them as NULL values, you need to change them to NaN

In [18]:
df = pd.read_csv(r"D:\Ankit\Pandas\4_read_write_to_excel\stock_data.csv",header=1,na_values=["not available","n.a."])

In [19]:
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [23]:
#now above dataframe shows revenue(4th row) as -1 which is impossible as no company has -1 as revenue.
#We need to convert that revenue with -1 as NaN but we cant directly put -1 in na_values=[] as we 
#got -1.00 in eps column(3rd row)
#So to just convert -1 of revenue into NaN
df = pd.read_csv(r"D:\Ankit\Pandas\4_read_write_to_excel\stock_data.csv",header=1,na_values={
    'eps':["not available","n.a."],
    'revenue':["not available","n.a.",-1],
    'people':["not available","n.a."],
    'price':["not available","n.a."]
})
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [24]:
#To remove the default index
df.to_csv(r'D:\Ankit\Pandas\4_read_write_to_excel\new_stocks_data.csv',index=False)

In [25]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [29]:
#Suppose we want just 2 specific columns
df.to_csv(r'D:\Ankit\Pandas\4_read_write_to_excel\new_stocks_data.csv',index=False,columns=['tickers','eps'])

<b>READ EXCEL</b>

In [39]:
#We want to replace every n.a. value in people column to "sam walton" while reading the excel
#We will use converters for achieving this

def convert_people_cell(cell):
    if cell == "n.a.":
        return "sam walton"
    return cell

In [42]:
#converters only accept dictionary
df = pd.read_excel(r"D:\Ankit\Pandas\4_read_write_to_excel\stock_data.xlsx",'Sheet1',converters = {
    'people':convert_people_cell
})

In [43]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65     sam walton
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [45]:
df.to_excel(r'D:\Ankit\Pandas\4_read_write_to_excel\new_excel_stocks_data.xlsx', startrow=1, startcol=2)

<b>TO CREATE TWO DIFFERENT WORKSHEETS IN A SINGLE WORKBOOK FROM DICTIONARY</b>

In [46]:
df.to_dict()

{'tickers': {0: 'GOOGL', 1: 'WMT', 2: 'MSFT', 3: 'RIL ', 4: 'TATA'},
 'eps': {0: 27.82, 1: 4.61, 2: -1, 3: 'not available', 4: 5.6},
 'revenue': {0: 87, 1: 484, 2: 85, 3: 50, 4: -1},
 'price': {0: 845, 1: 65, 2: 64, 3: 1023, 4: 'n.a.'},
 'people': {0: 'larry page',
  1: 'sam walton',
  2: 'bill gates',
  3: 'mukesh ambani',
  4: 'ratan tata'}}

In [47]:
df_stocks = pd.DataFrame({'tickers': {0: 'GOOGL', 1: 'WMT', 2: 'MSFT', 3: 'RIL ', 4: 'TATA'},
 'eps': {0: 27.82, 1: 4.61, 2: -1, 3: 'not available', 4: 5.6},
 'revenue': {0: 87, 1: 484, 2: 85, 3: 50, 4: -1},
 'price': {0: 845, 1: 65, 2: 64, 3: 1023, 4: 'n.a.'},
 'people': {0: 'larry page',
  1: 'sam walton',
  2: 'bill gates',
  3: 'mukesh ambani',
  4: 'ratan tata'}}
)

In [52]:
#Import Timestamp from pandas or you would get error
from pandas import Timestamp
df_weather = pd.DataFrame({'day': {0: Timestamp('2017-01-01 00:00:00'),
  1: Timestamp('2017-01-02 00:00:00'),
  2: Timestamp('2017-01-03 00:00:00')},
 'temperature': {0: 32, 1: 35, 2: 28},
 'windspeed': {0: 6, 1: 7, 2: 2},
 'event': {0: 'Rain', 1: 'Sunny', 2: 'Snow'}}
                         )

In [53]:
with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer,sheet_name="weather")